In [1]:
import warnings
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import text
from sqlalchemy.orm import sessionmaker
from sqlalchemy.engine import create_engine

# Config
warnings.filterwarnings("ignore")
pd.set_option("display.max_columns", None)

In [2]:
class DataBaseSession:
    def __init__(self) -> None:
        self.db_user = 'root'
        self.db_password = 'rushi12345'
        self.db_host = '192.168.29.7'
        self.db_name = 'key_prim'
    
    def LocalSession(self):
        engine = create_engine(f"mysql+pymysql://{self.db_user}:{self.db_password}@{self.db_host}/{self.db_name}")
        SessionLocal = sessionmaker(autoflush=True, bind=engine)
        return SessionLocal()

In [3]:
session = DataBaseSession()
db = session.LocalSession()

In [4]:
class SQL7:
    def __init__(self) -> None:
        pass
    
    def query(self, query: str) -> pd.DataFrame:
        return pd.DataFrame(db.execute(text(query)).fetchall())

In [5]:
data = SQL7()

In [8]:
data.query("""
show tables;
""")

  Tables_in_key_prim
0              class
1            payment
2              test1
3              test2

In [7]:
db.execute(text("""
create table test1(
course_id int unique NOT NULL,
course_name varchar(30),
course_status varchar(60),
number_of_enro int,
primary key(course_id));
"""))

In [7]:
data.query("""
show tables;
""")

  Tables_in_key_prim
0              class
1            payment
2              test1
3              test2

In [8]:
data.query("""
select * from test1;
""")

   course_id course_name course_status  number_of_enro
0          1     FSDS2.0        active             100
1          2     FSDS1.0    non-active             100
2          3     FSDA2.0        active             100

### Primary Key

* Condition: 1) It is not supposed to null 2) Key should not be duplicate

* Foreign key check primary key from another table if primary key is not present then it will return a error

* You can't create more than one primary key in one table

In [11]:
db.execute(text("""
INSERT INTO test1 VALUES(03, 'FSDA2.0', 'active', 100);
"""))

In [9]:
data.query("""
select * from test1;
""")

   course_id course_name course_status  number_of_enro
0          1     FSDS2.0        active             100
1          2     FSDS1.0    non-active             100
2          3     FSDA2.0        active             100

In [13]:
db.execute(text("""
create table test2(
student_id int unique NOT NULL,
course_name varchar(60),
student_mail varchar(60),
student_status varchar(60),
course_id1 int,
foreign key(course_id1) references test1(course_id)
);
"""))

In [16]:
db.execute(text("""
insert into test2 values(102, 'FSDS2.0', 'test2@gmail.com', 'active', 01)
"""))

In [10]:
data.query("""
select * from test2;
""")

   student_id course_name     student_mail student_status  course_id1
0         101     FSDS2.0  test1@gmail.com         active           1
1         102     FSDS2.0  test2@gmail.com         active           1

In [18]:
db.execute(text("""
commit;
"""))

In [19]:
data.query("select * from test2")

   student_id course_name     student_mail student_status  course_id1
0         101     FSDS2.0  test1@gmail.com         active           1
1         102     FSDS2.0  test2@gmail.com         active           1

* RelationShip b/w test1 and test2 (one to many relationship)

![data_modeling](./assets/data_modeling-1.png)

db.execute(text("""
update test2
set course_id1 = 1 where student_id = 102;
"""))

db.execute(text("""
commit;
"""))

In [23]:
db.execute(text("""
CREATE TABLE payment (
    course_id INT NOT NULL,
    course_name VARCHAR(30),
    course_live_status VARCHAR(60),
    course_launch_date VARCHAR(60),
    FOREIGN KEY (course_id) REFERENCES test1(course_id)
);
"""))

In [24]:
db.execute(text("""
insert into payment values(01, "FSDA2.0", "active", "07/08/2023")
"""))

db.execute(text("""
commit;
"""))

In [8]:
db.execute(text("""
create table class(
course_id int NOT NULL,
class_name varchar(30),
class_topic varchar(60),
class_duration decimal(10, 2),
primary key(course_id),
foreign key(course_id) references test1(course_id)
);
"""))

In [9]:
db.execute(text("""
insert into class values(01, "FSDA2.0", "SQL", 180)
"""))

In [10]:
db.execute(text("""
commit;
"""))

db.execute(text("""
create table test(
id int NOT NULL,
name varchar(30),
email_id varchar(60),
mobile_no varchar(12),
address varchar(50),
)
"""))

* Drop primary key
```python
db.execute(text("""
alter table test drop primary key
"""))
```

* Primary key using combination of columns
```python
db.execute(text("""
alter table test add constraints test_prism promary key(id, email_id); 
"""))
```

## Data Modeling